In [1]:
import pandas as pd
import numpy as np
from sklearn import linear_model

df = pd.read_csv('hiring.csv')
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [2]:
from word2number import w2n
import math

score_median = math.floor(df['test_score(out of 10)'].median())
df['test_score(out of 10)'] = df['test_score(out of 10)'].fillna(score_median)

df.experience = df.experience.fillna('zero')
df.experience = df.experience.apply(lambda x: w2n.word_to_num(x))
df

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           0                    8.0                           9      50000
1           0                    8.0                           6      45000
2           5                    6.0                           7      60000
3           2                   10.0                          10      65000
4           7                    9.0                           6      70000
5           3                    7.0                          10      62000
6          10                    8.0                           7      72000
7          11                    7.0                           8      80000

In [3]:
reg = linear_model.LinearRegression()
reg.fit(df[['experience','test_score(out of 10)','interview_score(out of 10)']],df['salary($)'])

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [4]:
print('price = {}x + {}x + {}x + {}'.format(round(reg.coef_[0],2), round(reg.coef_[1],2), 
                                            round(reg.coef_[2],2), round(reg.intercept_,2)))

price = 2812.95x + 1845.71x + 2205.24x + 17737.26

In [5]:
round(reg.predict([[2,9,6]])[0],2)

53205.97

In [6]:
round(reg.predict([[12,10,10]])[0],2)

92002.18